import { useState } from 'react'
import { BrowserRouter as Router, Routes, Route } from "react-router-dom";
import Header from './components/Header/Header.jsx'
import Promo from './components/Promo/Promo.jsx'
import Footer from './components/Footer/Footer.jsx'
import ArticleList from './components/ArticleList/ArticleList.jsx'
import ArticleDetails from './components/ArticleDetails/ArticleDetails.jsx'
import './App.css'

const articles = [
  {
    id: 1,
    title: "GIR: One Year In",
    description: "Case Study",
    image: "../../public/images/img1.jpg",
    content:
      "Хвала шаленцям! Бунтівникам, баламутам, невдахам; тим, хто завжди невчасно й не до ладу. Тим, хто бачить світ інакше. Вони не дотримуються правил. Сміються над засадами. Можна цитувати їх, сперечатися з ними, прославляти або проклинати. Але ігнорувати їх неможливо. Адже вони несуть зміни. Штовхають людство вперед. І нехай хтось каже: безумці, ми кажемо: генії. Адже тільки божевільний вірить, що може змінити світ, — і лише тому змінює його!",
  },
  {
    id: 2,
    title: "Introducing Onsen",
    description: "new additions",
    image: "../../public/images/img2.jpg",
    content:
      "Хвала шаленцям! Бунтівникам, баламутам, невдахам; тим, хто завжди невчасно й не до ладу. Тим, хто бачить світ інакше. Вони не дотримуються правил. Сміються над засадами. Можна цитувати їх, сперечатися з ними, прославляти або проклинати. Але ігнорувати їх неможливо. Адже вони несуть зміни. Штовхають людство вперед. І нехай хтось каже: безумці, ми кажемо: генії. Адже тільки божевільний вірить, що може змінити світ, — і лише тому змінює його!",
  },
  {
    id: 3,
    title: "Selling Your Shopify Brand: An Introduction",
    description: "Mergers & Acquisitions 101",
    image: "../../public/images/img3.jpg",
    content:
      "Хвала шаленцям! Бунтівникам, баламутам, невдахам; тим, хто завжди невчасно й не до ладу. Тим, хто бачить світ інакше. Вони не дотримуються правил. Сміються над засадами. Можна цитувати їх, сперечатися з ними, прославляти або проклинати. Але ігнорувати їх неможливо. Адже вони несуть зміни. Штовхають людство вперед. І нехай хтось каже: безумці, ми кажемо: генії. Адже тільки божевільний вірить, що може змінити світ, — і лише тому змінює його!",
  },
  {
    id: 4,
    title: "5 Reasons We Are Optimistic for 2023",
    description: "MERGERS & ACQUISITIONS 101",
    image: "../../public/images/img4.jpg",
    content:
      "Хвала шаленцям! Бунтівникам, баламутам, невдахам; тим, хто завжди невчасно й не до ладу. Тим, хто бачить світ інакше. Вони не дотримуються правил. Сміються над засадами. Можна цитувати їх, сперечатися з ними, прославляти або проклинати. Але ігнорувати їх неможливо. Адже вони несуть зміни. Штовхають людство вперед. І нехай хтось каже: безумці, ми кажемо: генії. Адже тільки божевільний вірить, що може змінити світ, — і лише тому змінює його!",
  },
  {
    id: 5,
    title: "Why Right Now is a Great Time to Sell Your Brand",
    description: "MERGERS & ACQUISITIONS 101",
    image: "../../public/images/img5.jpg",
    content:
      "Хвала шаленцям! Бунтівникам, баламутам, невдахам; тим, хто завжди невчасно й не до ладу. Тим, хто бачить світ інакше. Вони не дотримуються правил. Сміються над засадами. Можна цитувати їх, сперечатися з ними, прославляти або проклинати. Але ігнорувати їх неможливо. Адже вони несуть зміни. Штовхають людство вперед. І нехай хтось каже: безумці, ми кажемо: генії. Адже тільки божевільний вірить, що може змінити світ, — і лише тому змінює його!",
  },
  {
    id: 6,
    title: "Selling Your Shopify Brand: Week 1",
    description: "Mergers & Acquisitions 101",
    image: "../../public/images/img3.jpg",
    content:
      "Хвала шаленцям! Бунтівникам, баламутам, невдахам; тим, хто завжди невчасно й не до ладу. Тим, хто бачить світ інакше. Вони не дотримуються правил. Сміються над засадами. Можна цитувати їх, сперечатися з ними, прославляти або проклинати. Але ігнорувати їх неможливо. Адже вони несуть зміни. Штовхають людство вперед. І нехай хтось каже: безумці, ми кажемо: генії. Адже тільки божевільний вірить, що може змінити світ, — і лише тому змінює його!",
  },
  {
    id: 7,
    title: "Pattern's 2022 Update",
    description: "THOUGHT LEADERSHIP",
    image: "../../public/images/img7.jpg",
    content:
      "Хвала шаленцям! Бунтівникам, баламутам, невдахам; тим, хто завжди невчасно й не до ладу. Тим, хто бачить світ інакше. Вони не дотримуються правил. Сміються над засадами. Можна цитувати їх, сперечатися з ними, прославляти або проклинати. Але ігнорувати їх неможливо. Адже вони несуть зміни. Штовхають людство вперед. І нехай хтось каже: безумці, ми кажемо: генії. Адже тільки божевільний вірить, що може змінити світ, — і лише тому змінює його!",
  },
  {
    id: 8,
    title: "Introducing Yield",
    description: "New Additions",
    image: "../../public/images/img8.jpg",
    content:
      "Хвала шаленцям! Бунтівникам, баламутам, невдахам; тим, хто завжди невчасно й не до ладу. Тим, хто бачить світ інакше. Вони не дотримуються правил. Сміються над засадами. Можна цитувати їх, сперечатися з ними, прославляти або проклинати. Але ігнорувати їх неможливо. Адже вони несуть зміни. Штовхають людство вперед. І нехай хтось каже: безумці, ми кажемо: генії. Адже тільки божевільний вірить, що може змінити світ, — і лише тому змінює його!",
  },
  {
    id: 9,
    title: "Introducing Poketo",
    description: "new additions",
    image: "../../public/images/img9.jpg",
    content:
      "Хвала шаленцям! Бунтівникам, баламутам, невдахам; тим, хто завжди невчасно й не до ладу. Тим, хто бачить світ інакше. Вони не дотримуються правил. Сміються над засадами. Можна цитувати їх, сперечатися з ними, прославляти або проклинати. Але ігнорувати їх неможливо. Адже вони несуть зміни. Штовхають людство вперед. І нехай хтось каже: безумці, ми кажемо: генії. Адже тільки божевільний вірить, що може змінити світ, — і лише тому змінює його!",
  },
];

function App() {


  return (
    <>
      <Header />
      <Promo />
      <Router>
        <Routes>
          <Route path="/" element={<ArticleList articles={articles} />} />
          <Route path="/article/:id" element={<ArticleDetails articles={articles} />} />
        </Routes>
      </Router>
      <Footer />
      
    </>
  )
}

export default App
